app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])

    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "jakeperaltaKing"], ["password", "diehard"], ["updated_at", "2020-12-15 12:50:23.815910"], ["id", 10]]